Reports/АктСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>АктСверки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовЗаМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовЗаМесяц</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачислениеПоСреднему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КорректировкаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>КорректировкаНачислений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоРегиональнымСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.РасшифровкаНачисленияЛьгот</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодКорректировки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льготчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>InformationRegister.СостояниеРеструктуризацииДолга</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АктСверки/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	ТабличныйДокумент = Результат;
	СформироватьНаСервере(ТабличныйДокумент);
	ТабличныйДокумент.Показать();
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере(ТабличныйДокумент)
	Макет = Отчеты.АктСверки.ПолучитьМакет("МакетАктСверки");

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Новый Граница(Отчет.Период.ДатаОкончания,ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", Отчет.Период.ДатаОкончания);

	Запрос.УстановитьПараметр("ЛицевойСчет",Отчет.ЛицевойСчет);
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	СУММА(ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
	                |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет
	                |ИЗ
	                |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ), ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СУММА(ВЫБОР
	                |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) <> ТИП(Документ.КорректировкаНачислений)
	                |				ТОГДА ВЫБОР
	                |						КОГДА ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0) > 0
	                |							ТОГДА ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0)
	                |						КОГДА РасчетыПоЛицевымСчетамОбороты.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПениШтрафы)
	                |							ТОГДА ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0)
	                |						ИНАЧЕ 0
	                |					КОНЕЦ
	                |			ИНАЧЕ ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0)
	                |		КОНЕЦ) КАК СуммаПриход,
	                |	СУММА(ВЫБОР
	                |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) <> ТИП(Документ.КорректировкаНачислений)
	                |				ТОГДА ВЫБОР
	                |						КОГДА ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0) < 0
	                |								И РасчетыПоЛицевымСчетамОбороты.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПениШтрафы)
	                |							ТОГДА -ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0)
	                |						ИНАЧЕ ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаРасход, 0)
	                |					КОНЕЦ
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК СуммаРасход,
	                |	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет КАК ЛицевойСчет,
	                |	ВЫБОР
	                |		КОГДА РасчетыПоЛицевымСчетамОбороты.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |				ИЛИ ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
	                |			ТОГДА ""Аванс""
	                |		ИНАЧЕ РасчетыПоЛицевымСчетамОбороты.Услуга
	                |	КОНЕЦ КАК УслугаИтого
	                |ИЗ
	                |	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&НачалоПериода, &ОкончаниеПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОбороты
	                |ГДЕ
	                |	ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) <> ТИП(Документ.КорректировкаРегистров)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет,
	                |	ВЫБОР
	                |		КОГДА РасчетыПоЛицевымСчетамОбороты.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |				ИЛИ ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
	                |			ТОГДА ""Аванс""
	                |		ИНАЧЕ РасчетыПоЛицевымСчетамОбороты.Услуга
	                |	КОНЕЦ
	                |ИТОГИ
	                |	СУММА(СуммаПриход),
	                |	СУММА(СуммаРасход)
	                |ПО
	                |	ЛицевойСчет,
	                |	УслугаИтого
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
	                |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	                |ИЗ
	                |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&ОкончаниеПериода, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЛицевыеСчета.Наименование КАК ЛицевойСчет,
	                |	ЛицевыеСчета.Владелец КАК Здание,
	                |	ЛицевыеСчета.Владелец.Организация КАК Организация,
	                |	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, ""Невизначений"") КАК ОтветСтвенныйВладелец,
	                |	ЛицевыеСчета.ОбъектЛицевогоСчета.Наименование КАК Квартира
	                |ИЗ
	                |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&ОкончаниеПериода, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	                |		ПО ЛицевыеСчета.Ссылка = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	                |ГДЕ
	                |	ЛицевыеСчета.Ссылка = &ЛицевойСчет
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, ""Невизначений""),
	                |	ЛицевыеСчета.Наименование,
	                |	ЛицевыеСчета.Владелец,
	                |	ЛицевыеСчета.Владелец.Организация,
	                |	ЛицевыеСчета.ОбъектЛицевогоСчета.Наименование
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |			ТОГДА ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |		КОГДА (ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ПоступлениеНаСчет)
	                |				ИЛИ РасчетыПоЛицевымСчетам.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка))
	                |				И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.КорректировкаНачислений)
	                |			ТОГДА РасчетыПоЛицевымСчетам.Период
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.Услуга
	                |	КОНЕЦ КАК Услуга,
	                |	НАЧАЛОПЕРИОДА(РасчетыПоЛицевымСчетам.Период, МЕСЯЦ) КАК МесяцНачисления,
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |			ТОГДА ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.Услуга
	                |	КОНЕЦ КАК УслугаИгого,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК СуммаПриход,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК СуммаРасход,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	                |				И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.ВидНачисления
	                |	КОНЕЦ КАК ВидНачисления,
	                |	РасчетыПоЛицевымСчетам.Количество КАК КвоКубов
	                |ИЗ
	                |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	                |ГДЕ
	                |	РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет
	                |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ЗакрытиеМесяца)
	                |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.КорректировкаРегистров)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	НАЧАЛОПЕРИОДА(РасчетыПоЛицевымСчетам.Период, МЕСЯЦ),
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |			ТОГДА ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |		КОГДА (ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ПоступлениеНаСчет)
	                |				ИЛИ РасчетыПоЛицевымСчетам.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка))
	                |				И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.КорректировкаНачислений)
	                |			ТОГДА РасчетыПоЛицевымСчетам.Период
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.Услуга
	                |	КОНЕЦ,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |			ТОГДА ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.Услуга
	                |	КОНЕЦ,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	                |				И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.ВидНачисления
	                |	КОНЕЦ,
	                |	РасчетыПоЛицевымСчетам.Количество
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	МесяцНачисления,
	                |	ВидНачисления,
	                |	Услуга
	                |ИТОГИ ПО
	                |	МесяцНачисления
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ПоказанияПриборовЗаМесяц.Период,
	                |	ПоказанияПриборовЗаМесяц.ПриборУчета,
	                |	ПоказанияПриборовЗаМесяц.ПоказаниеПредыдущее,
	                |	ПоказанияПриборовЗаМесяц.Показание,
	                |	ПоказанияПриборовЗаМесяц.Разница,
	                |	ПоказанияПриборовЗаМесяц.Регистратор
	                |ИЗ
	                |	РегистрСведений.ПоказанияПриборовЗаМесяц КАК ПоказанияПриборовЗаМесяц
	                |ГДЕ
	                |	ПоказанияПриборовЗаМесяц.Период МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И ПоказанияПриборовЗаМесяц.ЛицевойСчет = &ЛицевойСчет";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = РезультатЗапроса[3].выбрать();
	ДанныеНачало = РезультатЗапроса[0].выбрать();
	ДанныеОкончание = РезультатЗапроса[2].выбрать();
	ДанныеПериод = РезультатЗапроса[1].выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДанныеПериодМесяц = РезультатЗапроса[4].выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДанныеПоПриборамУчета = РезультатЗапроса[5].Выбрать();
	
	//ШАПКА
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ПериодНачало =  ФОРМАТ(Отчет.Период.ДатаНачала,"Л=uk_UA; ДФ='dd.MM.yyyy'");
	ПериодОкончание =  ФОРМАТ(Отчет.Период.ДатаОкончания,"Л=uk_UA; ДФ='dd.MM.yyyy'");
	ПериодОкончание2 =  ФОРМАТ(Отчет.Период.ДатаОкончания,"Л=uk_UA; ДФ='dd MMMM yyyy'");


	ДанныеШапки.Следующий();
	ДанныеНачало.Следующий();
	Организация = ДанныеШапки.Организация;
	МассивДляФио = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДанныеШапки.ОтветСтвенныйВладелец," ");
	Если МассивДляФио.количество() = 3 И не ДанныеШапки.ОтветСтвенныйВладелец.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ФИО = МассивДляФио[0] + " " + МассивДляФио[1] + " " + МассивДляФио[2]; //МассивДляФио[0]+" "+Лев(МассивДляФио[1],1)+"."+Лев(МассивДляФио[2],1)+".";
	Иначе	
		ФИО =  Строка(ДанныеШапки.ОтветСтвенныйВладелец);
	КонецЕсли;
	
	ПердставлениеЛС = ФИО +" (" + ДанныеШапки.Квартира +" о\р " +ДанныеШапки.ЛицевойСчет+")";
	
	Шапка.Параметры.Организация = Организация;
	//Шапка.Параметры.ФИО = ФИО;

	Шапка.Параметры.ПердставлениеЛС = ПердставлениеЛС;
	Шапка.Параметры.МестоСоставвления = "37600, Полтавська обл., м.Миргород, пров.Луговий, буд.11";
	//УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Организация,Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	Шапка.Параметры.ПериодНачало = ПериодНачало;
	Шапка.Параметры.ПериодОкончание = ПериодОкончание;
	//Шапка.Параметры.ПериодОкончание2 = ПериодОкончание2;
	Попытка
		Если   ДанныеНачало.СуммаОстаток < 0 Тогда
			Шапка.Параметры.Оплачено =- ДанныеНачало.СуммаОстаток;
		Иначе
			Шапка.Параметры.Начислено = ДанныеНачало.СуммаОстаток;
		КонецЕсли;
	Исключение
	КонецПопытки;
	ТабличныйДокумент.Вывести(Шапка);
	
	
	//Строки
	
	Пока ДанныеПериод.Следующий() Цикл
		ОблатьИтогоПоЛС = Макет.ПолучитьОбласть("СтрокаЛС");
		ОблатьИтогоПоЛС.Параметры.Услуга = "Обсяг за період в т.ч.";
		Попытка
			ОблатьИтогоПоЛС.Параметры.Начислено = ДанныеПериод.СуммаПриход;
		Исключение
			ОблатьИтогоПоЛС.Параметры.Начислено = ДанныеПериод.СуммаПриход;
		КонецПопытки;
		
		ОблатьИтогоПоЛС.Параметры.Оплачено = ДанныеПериод.СуммаРасход;
		
		ДанныеПериодУслугаИтого  =  ДанныеПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		МассивОбластейИтогоУслуга = Новый Массив;
		
		Пока ДанныеПериодУслугаИтого.Следующий() Цикл
		
			ОбластьПериодУслугаИтого = Макет.ПолучитьОбласть("Строка");
			Если ТипЗнч(ДанныеПериодУслугаИтого.УслугаИтого) = Тип("Строка") Тогда
			    ОбластьПериодУслугаИтого.Параметры.Услуга = ДанныеПериодУслугаИтого.УслугаИтого;
			Иначе
				ОбластьПериодУслугаИтого.Параметры.Услуга = ДанныеПериодУслугаИтого.УслугаИтого.ПолноеНаименование;
			КонецЕсли;
			ОбластьПериодУслугаИтого.Параметры.Начислено = ДанныеПериодУслугаИтого.СуммаПриход;
			ОбластьПериодУслугаИтого.Параметры.Оплачено = ДанныеПериодУслугаИтого.СуммаРасход;
			//Если  ДанныеПериодУслугаИтого.УслугаИтого = "Аванс" Тогда
			//	//Ничего 
			//	Продолжить;
			//Иначе
				Если  ДанныеПериодУслугаИтого.СуммаПриход = 0 и ДанныеПериодУслугаИтого.СуммаРасход = 0 Тогда
					Продолжить;
				Иначе	
					МассивОбластейИтогоУслуга.Добавить(ОбластьПериодУслугаИтого);
				КонецЕсли;
				
			//КонецЕсли;
			
			
		
		КонецЦикла; 
		
		
	КонецЦикла;
	
	Пока ДанныеПериодМесяц.Следующий() Цикл
		
		ОбластьМесяц = Макет.ПолучитьОбласть("СтрокаИтог");
		ОбластьМесяц.Параметры.Услуга = "Всього за "+Формат(ДанныеПериодМесяц.МесяцНачисления,"Л=uk_UA; ДФ='MMMM yyyy'");
		ОбластьМесяц.Параметры.Начислено = ДанныеПериодМесяц.СуммаПриход;
		ОбластьМесяц.Параметры.Оплачено = ДанныеПериодМесяц.СуммаРасход;
		Детали = ДанныеПериодМесяц.Выбрать();
		Пока Детали.Следующий() Цикл
			Префикс = "";
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			Если ТипЗнч(Детали.Услуга) = Тип("Дата") Тогда
				ОбластьСтрока.Параметры.Услуга = "Оплата "+ Строка(Формат(Детали.Услуга,"Л=uk_UA; ДФ='dd.MM.yyyy'"));
			Иначе
				
				Если Детали.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
					Префикс = " (Пiльга)";
				ИначеЕсли Детали.ВидНачисления = Перечисления.ВидыНачислений.Субсидия ТОгда
					Префикс = " (Субсидiя)";
				ИначеЕсли Детали.ВидНачисления = Перечисления.ВидыНачислений.Корректировка ТОгда
					Префикс = " (Коригування)";	
				КонецЕсли;
				
				ОбластьСтрока.Параметры.Услуга = Строка(Детали.Услуга.ПолноеНаименование)+Префикс;
			КонецЕсли;
			ОбластьСтрока.Параметры.Кво = Детали.КвоКубов;
			Если Детали.КвоКубов <> 0 Тогда
			    ОбластьСтрока.Параметры.Тариф = Детали.СуммаПриход / Детали.КвоКубов;
			КонецЕсли;
			ОбластьСтрока.Параметры.Начислено = Детали.СуммаПриход;
			ОбластьСтрока.Параметры.Оплачено = Детали.СуммаРасход;
			Если  Детали.СуммаПриход = 0 и Детали.СуммаРасход = 0 Тогда
				Продолжить;
			Иначе
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			КонецЕсли;	
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьМесяц);
	КонецЦикла;
	Попытка
		ТабличныйДокумент.Вывести(ОблатьИтогоПоЛС);
	Исключение
	КонецПопытки;
	
	
	Инд = 0;
	Если МассивОбластейИтогоУслуга <> Неопределено Тогда
		Пока Инд<= МассивОбластейИтогоУслуга.ВГраница() Цикл
			
			ТабличныйДокумент.Вывести(МассивОбластейИтогоУслуга[Инд]);
			Инд = Инд+1;
		КонецЦикла;
	КонецЕсли;	
	
	
	ДанныеОкончание.Следующий();
	ОбластьСальдо = Макет.ПолучитьОбласть("СтрокаИтог");
	ОбластьСальдо.Параметры.Услуга = "Сальдо на "+ ПериодОкончание;
	//ОбластьСальдо.Параметры.Услуга2 = "Сальдо на "+ ПериодОкончание;
	Попытка
		Если ДанныеОкончание.СуммаОстаток < 0 Тогда
			
			ОбластьСальдо.Параметры.Оплачено	 = -ДанныеОкончание.СуммаОстаток;	
		Иначе   
			ОбластьСальдо.Параметры.Начислено = ДанныеОкончание.СуммаОстаток;
			
		КонецЕсли;
	Исключение
	КонецПопытки;
	ТабличныйДокумент.Вывести(ОбластьСальдо);
		
	Область = Макет.ПолучитьОбласть("Пробел");
	ТабличныйДокумент.Вывести(Область);
	Область = Макет.ПолучитьОбласть("Показания");
	ТабличныйДокумент.Вывести(Область);
	ОбластьШапкаПриборы = Макет.ПолучитьОбласть("ШапкаПриборы");
    ТабличныйДокумент.Вывести(ОбластьШапкаПриборы);
	ОбластьСтрокаПриборы = Макет.ПолучитьОбласть("СтрокаПриборы");
	Пока ДанныеПоПриборамУчета.Следующий() Цикл
		ОбластьСтрокаПриборы.Параметры.ПриборУчета = ДанныеПоПриборамУчета.ПриборУчета;
		ОбластьСтрокаПриборы.Параметры.Период = ДанныеПоПриборамУчета.Период;
		ОбластьСтрокаПриборы.Параметры.НачальныйПоказатель = ДанныеПоПриборамУчета.ПоказаниеПредыдущее;
		ОбластьСтрокаПриборы.Параметры.КвоКубов = ДанныеПоПриборамУчета.Разница;
		ОбластьСтрокаПриборы.Параметры.КонечныйПоказатель = ДанныеПоПриборамУчета.Показание;
		ОбластьСтрокаПриборы.Параметры.Регистратор = ДанныеПоПриборамУчета.Регистратор;
		ТабличныйДокумент.Вывести(ОбластьСтрокаПриборы);
	КонецЦикла;
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Организация = Организация;
	Подвал.Параметры.ФИО = Фио;
	ТабличныйДокумент.Вывести(Подвал);
	
	Возврат ТабличныйДокумент;
КонецФункции
